src/InformationRegisters/цур_XMLРолейКонфигурации/цур_XMLРолейКонфигурации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>цур_XMLРолейКонфигурации</name>
  <resources>
    <name>XMLТекст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.цур_ИнформационныеБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРоли</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/цур_РежимыЗагрузкиРолей/цур_РежимыЗагрузкиРолей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>цур_РежимыЗагрузкиРолей</name>
  <enumValues>
    <name>ИзКаталогаВыгрузки</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузитьАвтоматически</name>
  </enumValues>
  <enumValues>
    <name>ИзРегистра</name>
  </enumValues>
  <enumValues>
    <name>ИзРепозитория</name>
  </enumValues>
</mdclass:Enum>

src/CommonModules/цур_ПровайдерРолейСервер/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает XML-описание роли (содержимое Rights.xml) из источника,
// определённого в реквизите ИсточникРолей информационной базы.
//
// Параметры:
//  ИнформационнаяБаза - СправочникСсылка.цур_ИнформационныеБазы
//  ИмяРоли            - Строка - имя роли в конфигурации целевой ИБ
//
// Возвращаемое значение:
//  Строка - текст XML (содержимое Rights.xml) или пустая строка если роль не найдена
//
//BSLLS:LatinAndCyrillicSymbolInWord-off
Функция ПолучитьXMLРоли(ИнформационнаяБаза, ИмяРоли) Экспорт
//BSLLS:LatinAndCyrillicSymbolInWord-on

	Если НЕ ЗначениеЗаполнено(ИнформационнаяБаза) Или ПустаяСтрока(ИмяРоли) Тогда
		Возврат "";
	КонецЕсли;

	Реквизиты = цур_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ИнформационнаяБаза,
		"ИсточникРолей, КаталогВыгрузкиКонфигурации,
		|АдресБазы, СервернаяБаза, Пользователь, Пароль");

	Источник = Реквизиты.ИсточникРолей;

	Если Источник = Перечисления.цур_РежимыЗагрузкиРолей.ИзКаталогаВыгрузки Тогда
		Возврат ПрочитатьXMLРолиИзКаталога(Реквизиты.КаталогВыгрузкиКонфигурации, ИмяРоли);

	ИначеЕсли Источник = Перечисления.цур_РежимыЗагрузкиРолей.ВыгрузитьАвтоматически Тогда
		КаталогАвто = цур_ПровайдерМетаданныхСервер.ПолучитьИлиВыгрузитьКаталог(ИнформационнаяБаза, Реквизиты);
		Возврат ПрочитатьXMLРолиИзКаталога(КаталогАвто, ИмяРоли);

	ИначеЕсли Источник = Перечисления.цур_РежимыЗагрузкиРолей.ИзРегистра Тогда
		Возврат ПрочитатьXMLРолиИзРегистра(ИнформационнаяБаза, ИмяРоли);

	ИначеЕсли Источник = Перечисления.цур_РежимыЗагрузкиРолей.ИзРепозитория Тогда
		ВызватьИсключение НСтр("ru = 'Источник ролей ""Из репозитория"" пока не реализован.'");

	Иначе
		Возврат "";
	КонецЕсли;

КонецФункции

// Массовая загрузка Rights.xml всех ролей в регистр сведений цур_XMLРолейКонфигурации.
// Источник определяется реквизитом ИнформационнаяБаза.ЗагружатьРолиИз.
//
// Параметры:
//  ИнформационнаяБаза - СправочникСсылка.цур_ИнформационныеБазы
//
// Возвращаемое значение:
//  Структура - со свойствами:
//   * Успешно    - Булево
//   * Количество - Число    - количество загруженных ролей
//   * Ошибки     - Массив из Строка
//
Функция ЗагрузитьРолиВРегистр(ИнформационнаяБаза) Экспорт

	Результат = Новый Структура("Успешно, Количество, Ошибки", Ложь, 0, Новый Массив);

	Если НЕ ЗначениеЗаполнено(ИнформационнаяБаза) Тогда
		Результат.Ошибки.Добавить(НСтр("ru = 'Информационная база не указана.'"));
		Возврат Результат;
	КонецЕсли;

	ЗагружатьРолиИз = цур_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		ИнформационнаяБаза, "ЗагружатьРолиИз");

	ОбработкаЗагрузки = Обработки.цур_ЗагрузкаXMLРолей.Создать();

	Если ЗагружатьРолиИз = Перечисления.цур_РежимыЗагрузкиРолей.ИзКаталогаВыгрузки Тогда

		Каталог = цур_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			ИнформационнаяБаза, "КаталогВыгрузкиКонфигурации");
		Возврат ОбработкаЗагрузки.ЗагрузитьИзКаталогаВыгрузки(Каталог, ИнформационнаяБаза);

	ИначеЕсли ЗагружатьРолиИз = Перечисления.цур_РежимыЗагрузкиРолей.ВыгрузитьАвтоматически Тогда

		Реквизиты = цур_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			ИнформационнаяБаза,
			"АдресБазы, СервернаяБаза, Пользователь, Пароль");
		Попытка
			КаталогВыгрузки = цур_ПровайдерМетаданныхСервер.ПолучитьИлиВыгрузитьКаталог(
				ИнформационнаяБаза, Реквизиты);
		Исключение
			Результат.Ошибки.Добавить(цур_ОбщегоНазначения.ОписаниеОшибкиКраткое(ИнформацияОбОшибке()));
			Возврат Результат;
		КонецПопытки;
		Возврат ОбработкаЗагрузки.ЗагрузитьИзКаталогаВыгрузки(КаталогВыгрузки, ИнформационнаяБаза);

	ИначеЕсли ЗагружатьРолиИз = Перечисления.цур_РежимыЗагрузкиРолей.ИзРегистра Тогда
		Результат.Ошибки.Добавить(НСтр("ru = 'Нельзя загружать роли из самого регистра. Выберите другой режим.'"));
		Возврат Результат;

	ИначеЕсли ЗагружатьРолиИз = Перечисления.цур_РежимыЗагрузкиРолей.ИзРепозитория Тогда
		Результат.Ошибки.Добавить(НСтр("ru = 'Источник ролей ""Из репозитория"" пока не реализован.'"));
		Возврат Результат;

	Иначе
		Результат.Ошибки.Добавить(НСтр("ru = 'Режим загрузки ролей не задан.'"));
		Возврат Результат;

	КонецЕсли;

КонецФункции

// Фоновая процедура загрузки ролей в регистр.
// Результат (структура Успешно/Количество/Ошибки) помещается во временное хранилище.
//
// Параметры:
//  Параметры       - Структура - {ИнформационнаяБаза: СправочникСсылка.цур_ИнформационныеБазы}
//  АдресРезультата - Строка    - адрес временного хранилища
//
Процедура ЗагрузитьРолиВРегистрФоновоеЗадание(Параметры, АдресРезультата) Экспорт

	Результат = ЗагрузитьРолиВРегистр(Параметры.ИнформационнаяБаза);
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Читает содержимое файла Rights.xml из каталога выгрузки конфигурации.
// Путь к файлу формируется как {КаталогВыгрузки}/Roles/{ИмяРоли}/Ext/Rights.xml.
//
// Параметры:
//  КаталогВыгрузки - Строка - путь к каталогу с выгруженной конфигурацией
//  ИмяРоли        - Строка - имя роли
//
// Возвращаемое значение:
//  Строка - текст XML или пустая строка если файл не найден
//
//BSLLS:LatinAndCyrillicSymbolInWord-off
Функция ПрочитатьXMLРолиИзКаталога(КаталогВыгрузки, ИмяРоли)
//BSLLS:LatinAndCyrillicSymbolInWord-on

	Если ПустаяСтрока(КаталогВыгрузки) Тогда
		Возврат "";
	КонецЕсли;

	ПутьКФайлу = цур_ФайловыеОперацииСервер.ОбъединитьПути(КаталогВыгрузки, "Roles");
	ПутьКФайлу = цур_ФайловыеОперацииСервер.ОбъединитьПути(ПутьКФайлу, ИмяРоли);
	ПутьКФайлу = цур_ФайловыеОперацииСервер.ОбъединитьПути(ПутьКФайлу, "Ext");
	ПутьКФайлу = цур_ФайловыеОперацииСервер.ОбъединитьПути(ПутьКФайлу, "Rights.xml");

	Файл = Новый Файл(ПутьКФайлу);
	Если НЕ Файл.Существует() Тогда
		Возврат "";
	КонецЕсли;

	ТекстовыйФайл = Новый ТекстовыйДокумент;
	ТекстовыйФайл.Прочитать(ПутьКФайлу, КодировкаТекста.UTF8);
	Возврат ТекстовыйФайл.ПолучитьТекст();

КонецФункции

// Читает текст XML роли из регистра сведений цур_XMLРолейКонфигурации.
//
// Параметры:
//  ИнформационнаяБаза - СправочникСсылка.цур_ИнформационныеБазы
//  ИмяРоли            - Строка
//
// Возвращаемое значение:
//  Строка - текст XML или пустая строка если запись не найдена
//
//BSLLS:LatinAndCyrillicSymbolInWord-off
Функция ПрочитатьXMLРолиИзРегистра(ИнформационнаяБаза, ИмяРоли)
//BSLLS:LatinAndCyrillicSymbolInWord-on

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Рег.XMLТекст КАК XMLТекст
	|ИЗ
	|	РегистрСведений.цур_XMLРолейКонфигурации КАК Рег
	|ГДЕ
	|	Рег.ИнформационнаяБаза = &ИнформационнаяБаза
	|	И Рег.ИмяРоли = &ИмяРоли";

	Запрос.УстановитьПараметр("ИнформационнаяБаза", ИнформационнаяБаза);
	Запрос.УстановитьПараметр("ИмяРоли", ИмяРоли);

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();

	Возврат Выборка.XMLТекст;

КонецФункции

#КонецОбласти
